---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DocumentFailures.DUExcessiveRegeneration
source: html/ccd9a6f6-8da7-b728-81be-d2d388f52a23.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DocumentFailures.DUExcessiveRegeneration Property

Third party updater '[Name]' has caused an infinite loop and its action had to be canceled.

## Syntax (C#)
```csharp
public static FailureDefinitionId DUExcessiveRegeneration { get; }
```